espressif/esp-idf/components/soc/esp32s3/include/soc/rtc_cntl_reg.h
#define RTC_CNTL_INT_ENA_RTC_W1TS_REG          (DR_REG_RTCCNTL_BASE + 0x134)
/* RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS : WO ;bitpos:[20] ;default: 1'b0 ; */
/*description: .*/
#define RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS    (BIT(20))
#define RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_M  (BIT(20))
#define RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_S  20
/* RTC_CNTL_GLITCH_DET_INT_ENA_W1TS : WO ;bitpos:[19] ;default: 1'b0 ; */
/*description: enbale gitch det interrupt.*/
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TS    (BIT(19))
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TS_M  (BIT(19))
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TS_S  19
/* RTC_CNTL_TOUCH_TIMEOUT_INT_ENA_W1TS : WO ;bitpos:[18] ;default: 1'b0 ; */
/*description: enable touch timeout interrupt.*/
#define RTC_CNTL_TOUCH_TIMEOUT_INT_ENA_W1TS    (BIT(18))
#define RTC_CNTL_TOUCH_TIMEOUT_INT_ENA_W1TS_M  (BIT(18))
#define RTC_CNTL_TOUCH_TIMEOUT_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_TOUCH_TIMEOUT_INT_ENA_W1TS_S  18
/* RTC_CNTL_COCPU_TRAP_INT_ENA_W1TS : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: enable cocpu trap interrupt.*/
#define RTC_CNTL_COCPU_TRAP_INT_ENA_W1TS    (BIT(17))
#define RTC_CNTL_COCPU_TRAP_INT_ENA_W1TS_M  (BIT(17))
#define RTC_CNTL_COCPU_TRAP_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_COCPU_TRAP_INT_ENA_W1TS_S  17
/* RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: enable xtal32k_dead  interrupt.*/
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS    (BIT(16))
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS_M  (BIT(16))
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TS_S  16
/* RTC_CNTL_SWD_INT_ENA_W1TS : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: enable super watch dog interrupt.*/
#define RTC_CNTL_SWD_INT_ENA_W1TS    (BIT(15))
#define RTC_CNTL_SWD_INT_ENA_W1TS_M  (BIT(15))
#define RTC_CNTL_SWD_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_SWD_INT_ENA_W1TS_S  15
/* RTC_CNTL_SARADC2_INT_ENA_W1TS : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: enable saradc2 interrupt.*/
#define RTC_CNTL_SARADC2_INT_ENA_W1TS    (BIT(14))
#define RTC_CNTL_SARADC2_INT_ENA_W1TS_M  (BIT(14))
#define RTC_CNTL_SARADC2_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_SARADC2_INT_ENA_W1TS_S  14
/* RTC_CNTL_COCPU_INT_ENA_W1TS : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: enable riscV cocpu interrupt.*/
#define RTC_CNTL_COCPU_INT_ENA_W1TS    (BIT(13))
#define RTC_CNTL_COCPU_INT_ENA_W1TS_M  (BIT(13))
#define RTC_CNTL_COCPU_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_COCPU_INT_ENA_W1TS_S  13
/* RTC_CNTL_TSENS_INT_ENA_W1TS : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: enable tsens interrupt.*/
#define RTC_CNTL_TSENS_INT_ENA_W1TS    (BIT(12))
#define RTC_CNTL_TSENS_INT_ENA_W1TS_M  (BIT(12))
#define RTC_CNTL_TSENS_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_TSENS_INT_ENA_W1TS_S  12
/* RTC_CNTL_SARADC1_INT_ENA_W1TS : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: enable saradc1 interrupt.*/
#define RTC_CNTL_SARADC1_INT_ENA_W1TS    (BIT(11))
#define RTC_CNTL_SARADC1_INT_ENA_W1TS_M  (BIT(11))
#define RTC_CNTL_SARADC1_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_SARADC1_INT_ENA_W1TS_S  11
/* RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: enable RTC main timer interrupt.*/
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS    (BIT(10))
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS_M  (BIT(10))
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TS_S  10
/* RTC_CNTL_BROWN_OUT_INT_ENA_W1TS : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: enable brown out interrupt.*/
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TS    (BIT(9))
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TS_M  (BIT(9))
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TS_S  9
/* RTC_CNTL_TOUCH_INACTIVE_INT_ENA_W1TS : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: enable touch inactive interrupt.*/
#define RTC_CNTL_TOUCH_INACTIVE_INT_ENA_W1TS    (BIT(8))
#define RTC_CNTL_TOUCH_INACTIVE_INT_ENA_W1TS_M  (BIT(8))
#define RTC_CNTL_TOUCH_INACTIVE_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_TOUCH_INACTIVE_INT_ENA_W1TS_S  8
/* RTC_CNTL_TOUCH_ACTIVE_INT_ENA_W1TS : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: enable touch active interrupt.*/
#define RTC_CNTL_TOUCH_ACTIVE_INT_ENA_W1TS    (BIT(7))
#define RTC_CNTL_TOUCH_ACTIVE_INT_ENA_W1TS_M  (BIT(7))
#define RTC_CNTL_TOUCH_ACTIVE_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_TOUCH_ACTIVE_INT_ENA_W1TS_S  7
/* RTC_CNTL_TOUCH_DONE_INT_ENA_W1TS : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: enable touch done interrupt.*/
#define RTC_CNTL_TOUCH_DONE_INT_ENA_W1TS    (BIT(6))
#define RTC_CNTL_TOUCH_DONE_INT_ENA_W1TS_M  (BIT(6))
#define RTC_CNTL_TOUCH_DONE_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_TOUCH_DONE_INT_ENA_W1TS_S  6
/* RTC_CNTL_ULP_CP_INT_ENA_W1TS : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: enable ULP-coprocessor interrupt.*/
#define RTC_CNTL_ULP_CP_INT_ENA_W1TS    (BIT(5))
#define RTC_CNTL_ULP_CP_INT_ENA_W1TS_M  (BIT(5))
#define RTC_CNTL_ULP_CP_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_ULP_CP_INT_ENA_W1TS_S  5
/* RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA_W1TS : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: enable touch scan done interrupt.*/
#define RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA_W1TS    (BIT(4))
#define RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA_W1TS_M  (BIT(4))
#define RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA_W1TS_S  4
/* RTC_CNTL_WDT_INT_ENA_W1TS : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: enable RTC WDT interrupt.*/
#define RTC_CNTL_WDT_INT_ENA_W1TS    (BIT(3))
#define RTC_CNTL_WDT_INT_ENA_W1TS_M  (BIT(3))
#define RTC_CNTL_WDT_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_WDT_INT_ENA_W1TS_S  3
/* RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: enable SDIO idle interrupt.*/
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS    (BIT(2))
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS_M  (BIT(2))
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS_S  2
/* RTC_CNTL_SLP_REJECT_INT_ENA_W1TS : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: enable sleep reject interrupt.*/
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_M  (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_S  1
/* RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: enable sleep wakeup interrupt.*/
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_M  (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_V  0x1
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_S  0

#define RTC_CNTL_INT_ENA_RTC_W1TC_REG          (DR_REG_RTCCNTL_BASE + 0x138)
/* RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC : WO ;bitpos:[20] ;default: 1'b0 ; */
/*description: .*/
#define RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC    (BIT(20))
#define RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_M  (BIT(20))
#define RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_S  20
/* RTC_CNTL_GLITCH_DET_INT_ENA_W1TC : WO ;bitpos:[19] ;default: 1'b0 ; */
/*description: enbale gitch det interrupt.*/
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TC    (BIT(19))
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TC_M  (BIT(19))
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_GLITCH_DET_INT_ENA_W1TC_S  19
/* RTC_CNTL_TOUCH_TIMEOUT_INT_ENA_W1TC : WO ;bitpos:[18] ;default: 1'b0 ; */
/*description: enable touch timeout interrupt.*/
#define RTC_CNTL_TOUCH_TIMEOUT_INT_ENA_W1TC    (BIT(18))
#define RTC_CNTL_TOUCH_TIMEOUT_INT_ENA_W1TC_M  (BIT(18))
#define RTC_CNTL_TOUCH_TIMEOUT_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_TOUCH_TIMEOUT_INT_ENA_W1TC_S  18
/* RTC_CNTL_COCPU_TRAP_INT_ENA_W1TC : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: enable cocpu trap interrupt.*/
#define RTC_CNTL_COCPU_TRAP_INT_ENA_W1TC    (BIT(17))
#define RTC_CNTL_COCPU_TRAP_INT_ENA_W1TC_M  (BIT(17))
#define RTC_CNTL_COCPU_TRAP_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_COCPU_TRAP_INT_ENA_W1TC_S  17
/* RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: enable xtal32k_dead  interrupt.*/
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC    (BIT(16))
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC_M  (BIT(16))
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_XTAL32K_DEAD_INT_ENA_W1TC_S  16
/* RTC_CNTL_SWD_INT_ENA_W1TC : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: enable super watch dog interrupt.*/
#define RTC_CNTL_SWD_INT_ENA_W1TC    (BIT(15))
#define RTC_CNTL_SWD_INT_ENA_W1TC_M  (BIT(15))
#define RTC_CNTL_SWD_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_SWD_INT_ENA_W1TC_S  15
/* RTC_CNTL_SARADC2_INT_ENA_W1TC : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: enable saradc2 interrupt.*/
#define RTC_CNTL_SARADC2_INT_ENA_W1TC    (BIT(14))
#define RTC_CNTL_SARADC2_INT_ENA_W1TC_M  (BIT(14))
#define RTC_CNTL_SARADC2_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_SARADC2_INT_ENA_W1TC_S  14
/* RTC_CNTL_COCPU_INT_ENA_W1TC : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: enable riscV cocpu interrupt.*/
#define RTC_CNTL_COCPU_INT_ENA_W1TC    (BIT(13))
#define RTC_CNTL_COCPU_INT_ENA_W1TC_M  (BIT(13))
#define RTC_CNTL_COCPU_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_COCPU_INT_ENA_W1TC_S  13
/* RTC_CNTL_TSENS_INT_ENA_W1TC : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: enable tsens interrupt.*/
#define RTC_CNTL_TSENS_INT_ENA_W1TC    (BIT(12))
#define RTC_CNTL_TSENS_INT_ENA_W1TC_M  (BIT(12))
#define RTC_CNTL_TSENS_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_TSENS_INT_ENA_W1TC_S  12
/* RTC_CNTL_SARADC1_INT_ENA_W1TC : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: enable saradc1 interrupt.*/
#define RTC_CNTL_SARADC1_INT_ENA_W1TC    (BIT(11))
#define RTC_CNTL_SARADC1_INT_ENA_W1TC_M  (BIT(11))
#define RTC_CNTL_SARADC1_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_SARADC1_INT_ENA_W1TC_S  11
/* RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: enable RTC main timer interrupt.*/
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC    (BIT(10))
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC_M  (BIT(10))
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_MAIN_TIMER_INT_ENA_W1TC_S  10
/* RTC_CNTL_BROWN_OUT_INT_ENA_W1TC : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: enable brown out interrupt.*/
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TC    (BIT(9))
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TC_M  (BIT(9))
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_BROWN_OUT_INT_ENA_W1TC_S  9
/* RTC_CNTL_TOUCH_INACTIVE_INT_ENA_W1TC : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: enable touch inactive interrupt.*/
#define RTC_CNTL_TOUCH_INACTIVE_INT_ENA_W1TC    (BIT(8))
#define RTC_CNTL_TOUCH_INACTIVE_INT_ENA_W1TC_M  (BIT(8))
#define RTC_CNTL_TOUCH_INACTIVE_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_TOUCH_INACTIVE_INT_ENA_W1TC_S  8
/* RTC_CNTL_TOUCH_ACTIVE_INT_ENA_W1TC : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: enable touch active interrupt.*/
#define RTC_CNTL_TOUCH_ACTIVE_INT_ENA_W1TC    (BIT(7))
#define RTC_CNTL_TOUCH_ACTIVE_INT_ENA_W1TC_M  (BIT(7))
#define RTC_CNTL_TOUCH_ACTIVE_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_TOUCH_ACTIVE_INT_ENA_W1TC_S  7
/* RTC_CNTL_TOUCH_DONE_INT_ENA_W1TC : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: enable touch done interrupt.*/
#define RTC_CNTL_TOUCH_DONE_INT_ENA_W1TC    (BIT(6))
#define RTC_CNTL_TOUCH_DONE_INT_ENA_W1TC_M  (BIT(6))
#define RTC_CNTL_TOUCH_DONE_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_TOUCH_DONE_INT_ENA_W1TC_S  6
/* RTC_CNTL_ULP_CP_INT_ENA_W1TC : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: enable ULP-coprocessor interrupt.*/
#define RTC_CNTL_ULP_CP_INT_ENA_W1TC    (BIT(5))
#define RTC_CNTL_ULP_CP_INT_ENA_W1TC_M  (BIT(5))
#define RTC_CNTL_ULP_CP_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_ULP_CP_INT_ENA_W1TC_S  5
/* RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA_W1TC : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: enable touch scan done interrupt.*/
#define RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA_W1TC    (BIT(4))
#define RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA_W1TC_M  (BIT(4))
#define RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA_W1TC_S  4
/* RTC_CNTL_WDT_INT_ENA_W1TC : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: enable RTC WDT interrupt.*/
#define RTC_CNTL_WDT_INT_ENA_W1TC    (BIT(3))
#define RTC_CNTL_WDT_INT_ENA_W1TC_M  (BIT(3))
#define RTC_CNTL_WDT_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_WDT_INT_ENA_W1TC_S  3
/* RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: enable SDIO idle interrupt.*/
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC    (BIT(2))
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC_M  (BIT(2))
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC_S  2
/* RTC_CNTL_SLP_REJECT_INT_ENA_W1TC : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: enable sleep reject interrupt.*/
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_M  (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_S  1
/* RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: enable sleep wakeup interrupt.*/
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_M  (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_V  0x1
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_S  0

#define RTC_CNTL_RETENTION_CTRL_REG          (DR_REG_RTCCNTL_BASE + 0x13C)
/* RTC_CNTL_RETENTION_WAIT : R/W ;bitpos:[31:27] ;default: 5'd20 ; */
/*description: wait cycles for rention operation.*/
#define RTC_CNTL_RETENTION_WAIT    0x0000001F
#define RTC_CNTL_RETENTION_WAIT_M  ((RTC_CNTL_RETENTION_WAIT_V)<<(RTC_CNTL_RETENTION_WAIT_S))
#define RTC_CNTL_RETENTION_WAIT_V  0x1F
#define RTC_CNTL_RETENTION_WAIT_S  27
/* RTC_CNTL_RETENTION_EN : R/W ;bitpos:[26] ;default: 1'd0 ; */
/*description: .*/
#define RTC_CNTL_RETENTION_EN    (BIT(26))
#define RTC_CNTL_RETENTION_EN_M  (BIT(26))
#define RTC_CNTL_RETENTION_EN_V  0x1
#define RTC_CNTL_RETENTION_EN_S  26

#define RTC_CNTL_FIB_SEL_REG          (DR_REG_RTCCNTL_BASE + 0x140)
/* RTC_CNTL_FIB_SEL : R/W ;bitpos:[2:0] ;default: 3'd7 ; */
/*description: select use analog fib signal.*/
#define RTC_CNTL_FIB_SEL    0x00000007
#define RTC_CNTL_FIB_SEL_M  ((RTC_CNTL_FIB_SEL_V)<<(RTC_CNTL_FIB_SEL_S))
#define RTC_CNTL_FIB_SEL_V  0x7
#define RTC_CNTL_FIB_SEL_S  0

#define RTC_CNTL_DATE_REG          (DR_REG_RTCCNTL_BASE + 0x144)
/* RTC_CNTL_DATE : R/W ;bitpos:[27:0] ;default: 28'h2003251 ; */
/*description: .*/
#define RTC_CNTL_DATE    0x0FFFFFFF
#define RTC_CNTL_DATE_M  ((RTC_CNTL_DATE_V)<<(RTC_CNTL_DATE_S))
#define RTC_CNTL_DATE_V  0xFFFFFFF
#define RTC_CNTL_DATE_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_RTC_CNTL_REG_H_ */
